Res-container-setEven-randomFront-v6/container_t_10_c_30_frontCore_6_wrkCore_1/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 4918.465ms, rate sampling interval: 17514ms
  Thread calibration: mean lat.: 5001.237ms, rate sampling interval: 17727ms
  Thread calibration: mean lat.: 4943.132ms, rate sampling interval: 17678ms
  Thread calibration: mean lat.: 4934.424ms, rate sampling interval: 17629ms
  Thread calibration: mean lat.: 4948.979ms, rate sampling interval: 17727ms
  Thread calibration: mean lat.: 4917.116ms, rate sampling interval: 17563ms
  Thread calibration: mean lat.: 4911.416ms, rate sampling interval: 17711ms
  Thread calibration: mean lat.: 4884.826ms, rate sampling interval: 17629ms
  Thread calibration: mean lat.: 4912.134ms, rate sampling interval: 17711ms
  Thread calibration: mean lat.: 4926.241ms, rate sampling interval: 17727ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    33.04s    12.92s    0.95m    59.70%
    Req/Sec   263.20      4.56   271.00     70.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   33.41s 
 75.000%   43.61s 
 90.000%   50.59s 
 99.000%    0.95m 
 99.900%    0.98m 
 99.990%    0.99m 
 99.999%    0.99m 
100.000%    0.99m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9756.671     0.000000            1         1.00
   14950.399     0.100000        13151         1.11
   19808.255     0.200000        26343         1.25
   24428.543     0.300000        39456         1.43
   29130.751     0.400000        52586         1.67
   33406.975     0.500000        65761         2.00
   35520.511     0.550000        72355         2.22
   37617.663     0.600000        78886         2.50
   39714.815     0.650000        85557         2.86
   41713.663     0.700000        92070         3.33
   43614.207     0.750000        98604         4.00
   44630.015     0.775000       101918         4.44
   45711.359     0.800000       105181         5.00
   46989.311     0.825000       108485         5.71
   48300.031     0.850000       111811         6.67
   49479.679     0.875000       115076         8.00
   50069.503     0.887500       116729         8.89
   50593.791     0.900000       118300        10.00
   51216.383     0.912500       119979        11.43
   51904.511     0.925000       121638        13.33
   52559.871     0.937500       123263        16.00
   52920.319     0.943750       124090        17.78
   53280.767     0.950000       124918        20.00
   53608.447     0.956250       125734        22.86
   53936.127     0.962500       126522        26.67
   54296.575     0.968750       127324        32.00
   54558.719     0.971875       127769        35.56
   54820.863     0.975000       128147        40.00
   55181.311     0.978125       128583        45.71
   55574.527     0.981250       128993        53.33
   55967.743     0.984375       129379        64.00
   56197.119     0.985938       129598        71.11
   56459.263     0.987500       129806        80.00
   56688.639     0.989062       130005        91.43
   56918.015     0.990625       130212       106.67
   57180.159     0.992188       130436       128.00
   57278.463     0.992969       130522       142.22
   57442.303     0.993750       130627       160.00
   57606.143     0.994531       130717       182.86
   57769.983     0.995313       130826       213.33
   57933.823     0.996094       130922       256.00
   58032.127     0.996484       130977       284.44
   58097.663     0.996875       131021       320.00
   58228.735     0.997266       131078       365.71
   58359.807     0.997656       131134       426.67
   58490.879     0.998047       131179       512.00
   58589.183     0.998242       131213       568.89
   58654.719     0.998437       131228       640.00
   58753.023     0.998633       131256       731.43
   58851.327     0.998828       131287       853.33
   58884.095     0.999023       131303      1024.00
   58949.631     0.999121       131319      1137.78
   58982.399     0.999219       131335      1280.00
   59047.935     0.999316       131355      1462.86
   59047.935     0.999414       131355      1706.67
   59080.703     0.999512       131371      2048.00
   59113.471     0.999561       131376      2275.56
   59146.239     0.999609       131387      2560.00
   59146.239     0.999658       131387      2925.71
   59179.007     0.999707       131402      3413.33
   59179.007     0.999756       131402      4096.00
   59211.775     0.999780       131404      4551.11
   59244.543     0.999805       131414      5120.00
   59244.543     0.999829       131414      5851.43
   59244.543     0.999854       131414      6826.67
   59277.311     0.999878       131424      8192.00
   59277.311     0.999890       131424      9102.22
   59277.311     0.999902       131424     10240.00
   59277.311     0.999915       131424     11702.86
   59277.311     0.999927       131424     13653.33
   59277.311     0.999939       131424     16384.00
   59277.311     0.999945       131424     18204.44
   59310.079     0.999951       131427     20480.00
   59310.079     0.999957       131427     23405.71
   59310.079     0.999963       131427     27306.67
   59310.079     0.999969       131427     32768.00
   59342.847     0.999973       131431     36408.89
   59342.847     1.000000       131431          inf
#[Mean    =    33044.236, StdDeviation   =    12922.077]
#[Max     =    59310.080, Total count    =       131431]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  156359 requests in 1.00m, 64.53MB read
  Socket errors: connect 0, read 0, write 0, timeout 58
Requests/sec:   2605.99
Transfer/sec:      1.08MB